; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c8-s6-p4-a5)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 a4 
          c0 c1 c2 c3 c4 c5 c6 c7 
          t0 t1 t2 t3 t4 t5 t6 t7 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 l4-0 l4-1 l4-2 l4-3 l4-4 l4-5 l5-0 l5-1 l5-2 l5-3 l5-4 l5-5 l6-0 l6-1 l6-2 l6-3 l6-4 l6-5 l7-0 l7-1 l7-2 l7-3 l7-4 l7-5 
          p0 p1 p2 p3 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (AIRPLANE a4)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (CITY c7)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (TRUCK t7)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l4-5)
    (in-city  l4-5 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l5-3)
    (in-city  l5-3 c5)
    (LOCATION l5-4)
    (in-city  l5-4 c5)
    (LOCATION l5-5)
    (in-city  l5-5 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l6-2)
    (in-city  l6-2 c6)
    (LOCATION l6-3)
    (in-city  l6-3 c6)
    (LOCATION l6-4)
    (in-city  l6-4 c6)
    (LOCATION l6-5)
    (in-city  l6-5 c6)
    (LOCATION l7-0)
    (in-city  l7-0 c7)
    (LOCATION l7-1)
    (in-city  l7-1 c7)
    (LOCATION l7-2)
    (in-city  l7-2 c7)
    (LOCATION l7-3)
    (in-city  l7-3 c7)
    (LOCATION l7-4)
    (in-city  l7-4 c7)
    (LOCATION l7-5)
    (in-city  l7-5 c7)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (AIRPORT l7-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (at t0 l0-4)
    (at t1 l1-0)
    (at t2 l2-1)
    (at t3 l3-3)
    (at t4 l4-2)
    (at t5 l5-3)
    (at t6 l6-3)
    (at t7 l7-1)
    (at p0 l0-4)
    (at p1 l7-0)
    (at p2 l4-4)
    (at p3 l4-2)
    (at a0 l2-0)
    (at a1 l7-0)
    (at a2 l0-0)
    (at a3 l1-0)
    (at a4 l3-0)
)
(:goal
    (and
        (at p0 l0-5)
        (at p1 l0-1)
        (at p2 l0-3)
        (at p3 l2-5)
    )
)

  (:constraints
    (and
      (always (not (in p0 a0)))
      (always (not (in p0 a1)))
      (always (not (in p0 a2)))
      (always (not (in p0 a3)))
      (always (not (in p0 a4)))
    )
  )
)

; plan
1. (drive-truck t2 l2-1 l2-5 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-5)
   goals met: 0 of 4
2. (load-airplane p1 a1 l7-0)
   deleted: (at p1 l7-0)
   added: (in p1 a1)
   goals met: 0 of 4
3. (load-truck p3 t4 l4-2)
   deleted: (at p3 l4-2)
   added: (in p3 t4)
   goals met: 0 of 4
4. (load-truck p0 t0 l0-4)
   deleted: (at p0 l0-4)
   added: (in p0 t0)
   goals met: 0 of 4
5. (fly-airplane a0 l2-0 l4-0)
   deleted: (at a0 l2-0)
   added: (at a0 l4-0)
   goals met: 0 of 4
6. (fly-airplane a1 l7-0 l0-0)
   deleted: (at a1 l7-0)
   added: (at a1 l0-0)
   goals met: 0 of 4
7. (drive-truck t4 l4-2 l4-4 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-4)
   goals met: 0 of 4
8. (drive-truck t0 l0-4 l0-5 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-5)
   goals met: 0 of 4
9. (drive-truck t2 l2-5 l2-0 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-0)
   goals met: 0 of 4
10. (unload-truck p0 t0 l0-5)
   deleted: (in p0 t0)
   added: (at p0 l0-5)
   goals met: 1 of 4
11. (unload-airplane p1 a1 l0-0)
   deleted: (in p1 a1)
   added: (at p1 l0-0)
   goals met: 1 of 4
12. (load-truck p2 t4 l4-4)
   deleted: (at p2 l4-4)
   added: (in p2 t4)
   goals met: 1 of 4
13. (drive-truck t0 l0-5 l0-3 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-3)
   goals met: 1 of 4
14. (drive-truck t4 l4-4 l4-0 c4)
   deleted: (at t4 l4-4)
   added: (at t4 l4-0)
   goals met: 1 of 4
15. (fly-airplane a1 l0-0 l4-0)
   deleted: (at a1 l0-0)
   added: (at a1 l4-0)
   goals met: 1 of 4
16. (unload-truck p3 t4 l4-0)
   deleted: (in p3 t4)
   added: (at p3 l4-0)
   goals met: 1 of 4
17. (unload-truck p2 t4 l4-0)
   deleted: (in p2 t4)
   added: (at p2 l4-0)
   goals met: 1 of 4
18. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 1 of 4
19. (load-airplane p3 a0 l4-0)
   deleted: (at p3 l4-0)
   added: (in p3 a0)
   goals met: 1 of 4
20. (load-airplane p2 a1 l4-0)
   deleted: (at p2 l4-0)
   added: (in p2 a1)
   goals met: 1 of 4
21. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 1 of 4
22. (fly-airplane a0 l4-0 l2-0)
   deleted: (at a0 l4-0)
   added: (at a0 l2-0)
   goals met: 1 of 4
23. (fly-airplane a1 l4-0 l0-0)
   deleted: (at a1 l4-0)
   added: (at a1 l0-0)
   goals met: 1 of 4
24. (unload-airplane p3 a0 l2-0)
   deleted: (in p3 a0)
   added: (at p3 l2-0)
   goals met: 1 of 4
25. (unload-airplane p2 a1 l0-0)
   deleted: (in p2 a1)
   added: (at p2 l0-0)
   goals met: 1 of 4
26. (load-truck p3 t2 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 t2)
   goals met: 1 of 4
27. (load-truck p2 t0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 1 of 4
28. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 1 of 4
29. (drive-truck t2 l2-0 l2-5 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-5)
   goals met: 1 of 4
30. (unload-truck p3 t2 l2-5)
   deleted: (in p3 t2)
   added: (at p3 l2-5)
   goals met: 2 of 4
31. (unload-truck p2 t0 l0-3)
   deleted: (in p2 t0)
   added: (at p2 l0-3)
   goals met: 3 of 4
32. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 3 of 4
33. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 4 of 4
